/* Напишите программу, которая будет считать факториал переданного в консоли числа.
Факториал целого числа — это произведение этого целого числа на все целые положительные числа меньше него.
Обозначается восклицательным знаком. Вот примеры расчётов факториала для некоторых чисел:
        3! = 1 ? 2 ? 3 = 6
        5! = 1 ? 2 ? 3 ? 4 ? 5 = 120
*/


import java.util.Scanner;


public class Main {
    public static void main(String[] args) {

        System.out.println("Введите число от 1 до 12:");
        int value = new Scanner(System.in).nextInt();

        if (value >= 0 && value <= 12) {
            int result = 1;
            for (int i = 1; i <= value; i++)
                result *= i;
            System.out.println("Факториал равен: " + result);
        } else {
            System.out.println("Введено неверное значение. Введите число от 1 до 12: ");
        }
    }
}


